import java.io.*;
import java.util.Objects;

public class main10_8 {
    public static String hittt( int x, int y) {
         if((x > -3 & x < 2 & y > -(2 / 3) * x - 3 & y > (7 / 2) * x - 3 & y < 4 & y > -3) || (x > -3 & x < 0 & y > -(2 / 3) * x - 3 & y < x + 2 & y < 1 & y > -3) || (y < x + 2 & x > -3 & x < -1 & x > -1 * (Math.sqrt(4 - Math.pow(y + 3, 2))) - 1 & y < 5 & y > 1) || (y < Math.sqrt(4 - Math.pow(x + 1, 2)) + 3 & x > -3 & x < -1 & y < -(1 / 2) * x + (5 / 2) & y < 5) || (x > -2 & x < 2 & y < 4 & y < -(1 / 2) * x + (5 / 2) & y < 2 * x) & (x > 1 & x < 2 & y < 4 & y > -3 & y <2 * x & y > (7 / 2) * x - 3)){
            return"попало в область 1 фигуры";
        } else   if ((x >= -3 & x <= 2 & y >= -(2 / 3) * x - 3 & y >= (7 / 2) * x - 3 & y <= 4 & y >= -3) || (x > -3 & x <= 0 & y >= -(2 / 3) * x - 3 & y <= x + 2 & y <= 1 & y >= -3) || (y <= x + 2 & x >= -3 & x <= -1 & x >= -1 * (Math.sqrt(4 - Math.pow(y + 3, 2))) - 1 & y < 5 & y >= 1) || (y <= Math.sqrt(4 - Math.pow(x + 1, 2)) + 3 & x >= -3 & x <= -1 & y <= -(1 / 2) * x + (5 / 2) & y <= 5) || (x >= -2 & x <= 2 & y <= 4 & y <= -(1 / 2) * x + (5 / 2) & y <= 2 * x) & (x >= 1 & x <= 2 & y <= 4 & y >= -3 & y <= 2 * x & y >= (7 / 2) * x - 3)) {
        return "попало на границу 1 фигуры";}
         if ((y > - Math.sqrt(4-Math.pow(x-4,2))-1 & x>2 & x<7 & y>-3 & y<0 & y> x-7) || (y > - Math.sqrt(4-Math.pow(x-4,2))-1 & x>2 & y>-3 & y<0 & x<6 & y<x-3)|| (y<x-3 & y<-x+3 & x>2 & y <1 & y >-1 & x<6)||(y<-x+3 & x>1 & x<5 & y>0 & y<1 & y<-((1)/(3))*x + (5/3))||(y<-((1)/(3))*x + (5/3) & x>2 & x< 7 & y<5 & y>-1)||( y<5 & y>0 & x>5 & x<7 & y<-((5)/(2))*x+((35)/(2)))||(y<-((5)/(2))*x+((35)/(2)) & y<5 & y>-1 & x>5 & x<7 & y>x-7 )){
             return "попало в область 2 фигуры";
         }
         else if ((y >= - Math.sqrt(4-Math.pow(x-4,2))-1 & x>=2 & x<=7 & y>=-3 & y<=0 & y>= x-7) || (y >= - Math.sqrt(4-Math.pow(x-4,2))-1 & x>=2 & y>=-3 & y<=0 & x<=6 & y<=x-3)|| (y<=x-3 & y<=-x+3 & x>=2 & y <=1 & y >=-1 & x<=6)||(y<=-x+3 & x>=1 & x<=5 & y>=0 & y<=1 & y<=-((1)/(3))*x + (5/3))||(y<=-((1)/(3))*x + (5/3) & x>=2 & x<= 7 & y<=5 & y>=-1)||( y<=5 & y>=0 & x>=5 & x<=7 & y<=-((5)/(2))*x+((35)/(2)))||(y<=-((5)/(2))*x+((35)/(2)) & y<=5 & y>=-1 & x>=5 & x<=7 & y>=x-7 )){
            return "попало на границу 2 фигуры";
        }
         else {
            return "Никуда не попало";
        }
    }

    public static void main(String[] args) throws IOException{
        File file = new File("10_8.txt");
        FileWriter writer = new FileWriter(file,true);
        writer.write("Фигура 1\n"+
                "1 область\n"+
                "(x >= -3 & x<=2 & y >=-(2/3)*x-3 & y>= (7/2)*x-3 & y <=4 & y>=-3) || (x>-3 & x <=0 & y >=-(2/3)*x-3 & y<=x+2 & y<=1 & y>=-3)\n"+
                "2 область\n"+" (y<=x+2 & x>=-3 & x<=-1 & x >= -1*(Math.sqrt(4-Math.pow(y+3,2)))-1 & y<5 & y>=1) || (y <= Math.sqrt(4-Math.pow(x+1,2))+3 & x>=-3 & x<=-1& y<=-(1/2)*x+(5/2) & y<=5)"
                +"3 область\n"+
                "(x>=-2 & x<=2 & y <=4 & y<=-(1/2)*x+(5/2) & y<=2*x) &(x>=1 & x<=2 & y <=4 & y>=-3 & y<=2*x & y>=(7/2)*x -3))\n"+
                "Фигура 2\n"+
                "1 область\n"+"(y >= - Math.sqrt(4-Math.pow(x-4,2))-1 & x>=2 & x<=7 & y>=-3 & y<=0 & y>= x-7) || (y >= - Math.sqrt(4-Math.pow(x-4,2))-1 & x>=2 & y>=-3 & y<=0 & x<=6 & y<=x-3)\n"+
                "2 область\n"+"(y<=x-3 & y<=-x+3 & x>=2 & y <=1 & y >=-1 & x<=6)||(y<=-x+3 & x>=1 & x<=5 & y>=0 & y<=1 & y<=-((1)/(3))*x + (5/3))\n"+
                "3 область\n"+"(y<=-((1)/(3))*x + (5/3) & x>=2 & x<= 7 & y<=5 & y>=-1)||( y<=5 & y>=0 & x>=5 & x<=7 & y<=-((5)/(2))*x+((35)/(2)))\n"+
                "4 область\n"+ "(y<=-((5)/(2))*x+((35)/(2)) & y<=5 & y>=-1 & x>=5 & x<=7 & y>=x-7 )\n"+
                "Точки ( -3; 2) , ( 0,1), (4;-1),(1000;-3)\n"
                +"Вывод\n");
        writer.write("Для 1 точки ( -3; 2) ");
        writer.write(hittt(-3, 2)+ "\n");
        writer.write("Для 2 точки ( 0; 1) ");
        writer.write(hittt(0, 1)+ "\n");
        writer.write("Для 3 точки ( 4; -1) ");
        writer.write(hittt(4, -1)+ "\n");
        writer.write("Для 4 точки ( 1000; -3) ");
        writer.write(hittt(1000, -3)+ "\n");
        writer.flush();
        writer.close();

    }

}
